---
kind: method
id: M:Autodesk.Revit.DB.Structure.MemberForcesServiceData.Dispose
source: html/d5198010-9de3-4f7e-41ce-68223b98de36.htm
---
# Autodesk.Revit.DB.Structure.MemberForcesServiceData.Dispose Method

Releases all resources used by the MemberForcesServiceData

## Syntax (C#)
```csharp
public void Dispose()
```